shared/jmeter/results/go/statistics.json
{
  "GET /bench/db simple" : {
    "transaction" : "GET /bench/db simple",
    "sampleCount" : 79091,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 8.681594618856769,
    "medianResTime" : 7.0,
    "minResTime" : 0.0,
    "maxResTime" : 118.0,
    "pct1ResTime" : 13.0,
    "pct2ResTime" : 16.0,
    "pct3ResTime" : 24.0,
    "throughput" : 1322.41506153023,
    "receivedKBytesPerSec" : 772.2787464156133,
    "sentKBytesPerSec" : 453.288756442491
  },
  "GET /bench/cpu" : {
    "transaction" : "GET /bench/cpu",
    "sampleCount" : 79067,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 7.316781969721935,
    "medianResTime" : 6.0,
    "minResTime" : 0.0,
    "maxResTime" : 107.0,
    "pct1ResTime" : 11.0,
    "pct2ResTime" : 14.0,
    "pct3ResTime" : 23.0,
    "throughput" : 1322.6993659768807,
    "receivedKBytesPerSec" : 511.51318454945044,
    "sentKBytesPerSec" : 462.4280986520735
  },
  "GET /bench/cache" : {
    "transaction" : "GET /bench/cache",
    "sampleCount" : 79081,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 8.170736333632624,
    "medianResTime" : 7.0,
    "minResTime" : 1.0,
    "maxResTime" : 118.0,
    "pct1ResTime" : 12.0,
    "pct2ResTime" : 15.0,
    "pct3ResTime" : 24.0,
    "throughput" : 1321.9605155380218,
    "receivedKBytesPerSec" : 886.9081986520202,
    "sentKBytesPerSec" : 441.514156556644
  },
  "POST /auth/login" : {
    "transaction" : "POST /auth/login",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 417.0,
    "medianResTime" : 417.0,
    "minResTime" : 417.0,
    "maxResTime" : 417.0,
    "pct1ResTime" : 417.0,
    "pct2ResTime" : 417.0,
    "pct3ResTime" : 417.0,
    "throughput" : 2.398081534772182,
    "receivedKBytesPerSec" : 1.323160221822542,
    "sentKBytesPerSec" : 0.4215377697841727
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 316349,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 8.671381923129013,
    "medianResTime" : 8.0,
    "minResTime" : 0.0,
    "maxResTime" : 625.0,
    "pct1ResTime" : 16.0,
    "pct2ResTime" : 21.0,
    "pct3ResTime" : 40.0,
    "throughput" : 5202.766265377278,
    "receivedKBytesPerSec" : 8036.856818501867,
    "sentKBytesPerSec" : 1782.0961004056064
  },
  "GET /tasks (list)" : {
    "transaction" : "GET /tasks (list)",
    "sampleCount" : 79109,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 10.51035912475196,
    "medianResTime" : 8.0,
    "minResTime" : 1.0,
    "maxResTime" : 625.0,
    "pct1ResTime" : 16.0,
    "pct2ResTime" : 19.0,
    "pct3ResTime" : 30.0,
    "throughput" : 1317.4732704926223,
    "receivedKBytesPerSec" : 5976.277920000916,
    "sentKBytesPerSec" : 452.8814367318389
  }
}