shared/jmeter/results/python/statistics.json
{
  "GET /bench/db simple" : {
    "transaction" : "GET /bench/db simple",
    "sampleCount" : 559,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1659.9338103756709,
    "medianResTime" : 10.0,
    "minResTime" : 2.0,
    "maxResTime" : 58970.0,
    "pct1ResTime" : 129.0,
    "pct2ResTime" : 229.0,
    "pct3ResTime" : 58929.8,
    "throughput" : 7.617256697462731,
    "receivedKBytesPerSec" : 3.0246477103943534,
    "sentKBytesPerSec" : 2.610993262509198
  },
  "GET /bench/cpu" : {
    "transaction" : "GET /bench/cpu",
    "sampleCount" : 539,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 816.543599257885,
    "medianResTime" : 7.0,
    "minResTime" : 2.0,
    "maxResTime" : 58801.0,
    "pct1ResTime" : 23.0,
    "pct2ResTime" : 32.0,
    "pct3ResTime" : 58669.8,
    "throughput" : 7.36147721219902,
    "receivedKBytesPerSec" : 1.395121676921291,
    "sentKBytesPerSec" : 2.573641447233642
  },
  "GET /bench/cache" : {
    "transaction" : "GET /bench/cache",
    "sampleCount" : 544,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 557.9375,
    "medianResTime" : 7.0,
    "minResTime" : 2.0,
    "maxResTime" : 59219.0,
    "pct1ResTime" : 28.0,
    "pct2ResTime" : 55.5,
    "pct3ResTime" : 32350.099999997343,
    "throughput" : 7.387490154539776,
    "receivedKBytesPerSec" : 3.6951773371085577,
    "sentKBytesPerSec" : 2.46730628208262
  },
  "POST /auth/login" : {
    "transaction" : "POST /auth/login",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 254.0,
    "medianResTime" : 254.0,
    "minResTime" : 254.0,
    "maxResTime" : 254.0,
    "pct1ResTime" : 254.0,
    "pct2ResTime" : 254.0,
    "pct3ResTime" : 254.0,
    "throughput" : 3.937007874015748,
    "receivedKBytesPerSec" : 1.3917937992125984,
    "sentKBytesPerSec" : 0.6920521653543307
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 2225,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1541.1694382022472,
    "medianResTime" : 10.0,
    "minResTime" : 2.0,
    "maxResTime" : 59234.0,
    "pct1ResTime" : 113.0,
    "pct2ResTime" : 236.69999999999982,
    "pct3ResTime" : 58945.479999999996,
    "throughput" : 29.907521909780094,
    "receivedKBytesPerSec" : 43.35061434334507,
    "sentKBytesPerSec" : 10.242157991525081
  },
  "GET /tasks (list)" : {
    "transaction" : "GET /tasks (list)",
    "sampleCount" : 582,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3019.4329896907216,
    "medianResTime" : 42.5,
    "minResTime" : 3.0,
    "maxResTime" : 59234.0,
    "pct1ResTime" : 5969.400000000015,
    "pct2ResTime" : 11597.600000000004,
    "pct3ResTime" : 59186.76,
    "throughput" : 7.883721875296316,
    "receivedKBytesPerSec" : 35.60593730104439,
    "sentKBytesPerSec" : 2.7100293946331093
  }
}