shared/jmeter/results/rust/statistics.json
{
  "GET /bench/db simple" : {
    "transaction" : "GET /bench/db simple",
    "sampleCount" : 73357,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 9.453739929386424,
    "medianResTime" : 8.0,
    "minResTime" : 1.0,
    "maxResTime" : 153.0,
    "pct1ResTime" : 14.0,
    "pct2ResTime" : 16.0,
    "pct3ResTime" : 26.0,
    "throughput" : 1254.2874241258442,
    "receivedKBytesPerSec" : 658.996631080619,
    "sentKBytesPerSec" : 429.9364119806361
  },
  "GET /bench/cpu" : {
    "transaction" : "GET /bench/cpu",
    "sampleCount" : 73326,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 7.317936339088494,
    "medianResTime" : 7.0,
    "minResTime" : 1.0,
    "maxResTime" : 123.0,
    "pct1ResTime" : 11.0,
    "pct2ResTime" : 13.0,
    "pct3ResTime" : 23.0,
    "throughput" : 1254.2935340403697,
    "receivedKBytesPerSec" : 411.56538324816114,
    "sentKBytesPerSec" : 438.5127785023948
  },
  "GET /bench/cache" : {
    "transaction" : "GET /bench/cache",
    "sampleCount" : 73343,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 8.520581377909219,
    "medianResTime" : 8.0,
    "minResTime" : 1.0,
    "maxResTime" : 124.0,
    "pct1ResTime" : 13.0,
    "pct2ResTime" : 15.0,
    "pct3ResTime" : 24.0,
    "throughput" : 1254.2196077090136,
    "receivedKBytesPerSec" : 786.3394742804863,
    "sentKBytesPerSec" : 418.88975179344015
  },
  "POST /auth/login" : {
    "transaction" : "POST /auth/login",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 392.0,
    "medianResTime" : 392.0,
    "minResTime" : 392.0,
    "maxResTime" : 392.0,
    "pct1ResTime" : 392.0,
    "pct2ResTime" : 392.0,
    "pct3ResTime" : 392.0,
    "throughput" : 2.5510204081632653,
    "receivedKBytesPerSec" : 1.255580357142857,
    "sentKBytesPerSec" : 0.44842155612244894
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 293396,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 9.338130035855787,
    "medianResTime" : 9.0,
    "minResTime" : 1.0,
    "maxResTime" : 1567.0,
    "pct1ResTime" : 15.0,
    "pct2ResTime" : 18.0,
    "pct3ResTime" : 30.0,
    "throughput" : 4827.418266778551,
    "receivedKBytesPerSec" : 7169.4742055228535,
    "sentKBytesPerSec" : 1653.5280391071046
  },
  "GET /tasks (list)" : {
    "transaction" : "GET /tasks (list)",
    "sampleCount" : 73369,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 12.053592116561575,
    "medianResTime" : 11.0,
    "minResTime" : 1.0,
    "maxResTime" : 1567.0,
    "pct1ResTime" : 17.0,
    "pct2ResTime" : 20.0,
    "pct3ResTime" : 29.9900000000016,
    "throughput" : 1221.7781552347171,
    "receivedKBytesPerSec" : 5447.941547861401,
    "sentKBytesPerSec" : 419.986240861934
  }
}